author: Aegix AI
date: 2026/04/28
description: Auto-generated rule autonomously created by Aegix Brain after detection
  misses or critical threat identified.
detection:
  condition: selection
  selection:
    event_type: api_request
    source_ip: 169.254.169.126
level: critical
logsource:
  category: application
status: experimental
title: Auto Generated Rule 2714 1777391874
