author: Aegix AI
date: 2026/04/28
description: Auto-generated rule autonomously created by Aegix Brain after detection
  misses or critical threat identified.
detection:
  condition: selection
  selection:
    event_type: process_start
    payload.name: control-plane-api
    source_ip: localhost
level: critical
logsource:
  category: application
status: experimental
title: Auto Generated Rule 1615 1777396394
